[{"title":"A better way to learn about restaurant food safety","slug":"newsletter_nov_30_2023","author":"Seth Vincent","author_slug":"sethvincent","created":"11/30/2023, 5:15:00 PM","updated":"11/30/2023, 5:15:00 PM","content":"<img src=\"/images/photos/spooky_road_nov_29.jpg\" alt=\"A spooky, curvy road that almost disappears into fog and darkness. It's a slightly blurry photo, like the photographer was moving quickly. Liminal.\" class=\"not-prose border border-black shadow mt-5 mb-1\">\n<div class=\"not-prose text-xs font-sans\">My favorite kind of Olympia morning. Not pictured: the car flashing their lights behind me while I stood in the middle of the road 🤦‍♂️</div>\n<h2>How does your favorite restaurant score in safety inspections?</h2>\n<p>This week I've added a new feature to <em>The Mima Mercury</em>: <a href=\"https://mimamercury.com/food-inspections\">a food safety inspection explorer</a> for Thurston County.</p>\n<p>In this first release it only tracks the last 90 days of inspections, but it will update every day to pull in the most recent inspections, so you can check back any time.</p>\n<p>By default it sorts by the total points a restaurant received in the inspection. This makes it a leaderboard of the recent worst inspections in the county. I have mixed feelings about this. Right now the establishment in the #1 spot is the downtown taco truck Tacos California. I love that taco truck. The inspection happened in October. There has not yet been a follow-up inspection to evaluate progress. I wonder what their previous inspections have been like.</p>\n<p>There's a lot of opportunity with this data project to look for patterns in the inspections. I'd love to know if the Chevron on Pacific (a recent 0 score inspection) always gets a \"no violations\" result. Are there certain establishments or business owners that consistently get high or low points in inspections?</p>\n<p>That's why the next update to the food inspections data project will include historical inspections data, not just the last 90 days.</p>\n<h2>More data projects on the way</h2>\n<p>You may have noticed that this is the only thing posted to the site since the elections project (aside from keeping elections data up to date as new results are announced).</p>\n<p>During this phase of <em>The Mima Mercury</em> the focus is on setting up infrastructure for data reporting. The food inspection explorer is one type of tool that reporters might use to look for possible health and safety stories. But this isn't just for reporters, it's for any area resident that wants to understand where their food comes from.</p>\n<p>The topic of restaurant food safety might not be the most exciting thing for some people, but here's why I'm excited: the building blocks I created for this project can be reused for similar collections of data. So the next time we need an interactive table of data it could take a day or two instead of a couple weeks.</p>\n<p>As more of those building blocks are created and data projects can be produced more quickly I'll then start spending more time on analysis of data, other methods of information gathering, and news writing.</p>\n<p>I'd also love to collaborate on projects where I and reporters from other organizations work together to create packages of stories, visualizations, and data tools so that a reader can learn about a topic in depth. If you're familar with <a href=\"https://www.propublica.org/\">Propublica</a>, yeah, I'm basically trying to follow their well-established pattern of creating data tools and collaborating across organizations.</p>\n<h2>Thanks!</h2>\n<p>Thank you to those of you who made contributions after the last newsletter! I am able to pay various hosting/service costs with that, which makes a big difference.</p>\n<p>As a humble, grateful reminder here's where you can make a contribution: <a href=\"https://donate.stripe.com/4gw14n3GA8wheJOeUV\">Support <em>The Mima Mercury</em></a>.</p>\n<h2>What's next?</h2>\n<ul>\n<li>Making a lot of public record requests.</li>\n<li>Setting up non-profit status through fiscal sponsorship.</li>\n<li>Whatever you'd like to see! You can reply to this email to let me know what kinds of data projects would be useful to you.</li>\n</ul>\n<p>Just like the spooky photo above, the road to a well-funded, impactful news organization can be beautiful and unsettling.</p>\n<p>Let's see what happens.</p>\n<p>Oh, and have fun with the <a href=\"https://mimamercury.com/food-inspections\">food safety inspections explorer!</a></p>\n","topics":"[newsletter,newsletter_main,the_mima_mercury]","promoted":1,"published":1,"post_type":"newsletter"},{"title":"Welcome to The Mima Mercury!","slug":"newsletter_nov_16_2023","author":"Seth Vincent","author_slug":"sethvincent","created":"11/16/2023, 2:45:00 PM","updated":"11/16/2023, 2:45:00 PM","content":"<p>This is the first newsletter issue of <em>The Mima Mercury</em>! Welcome!</p>\n<p>The contents of each issue is likely to change considerably over the coming weeks. As early subscribers I suspect you're interested in what this project is and how it will operate. That'll be part of these first few weeks of newsletters. Discussing <em>The Mima Mercury</em> is the real meat of this first issue. And I do mean discussion! You can <a href=\"/about/contact/\">send an email</a> and your message will arrive at a real human. Please do ask questions or make suggestions of any kind, but I'd especially like to hear about topics you'd like to see covered.</p>\n<h2>About <em>The Mima Mercury</em></h2>\n<p>This publication is not intended to compete with existing news sources. There is a lot of local news to cover and a lot of different ways it can be covered. There's always room for more useful news. So how is <em>The Mima Mercury</em> different?</p>\n<h3>Crime won't be covered in the same way.</h3>\n<p>It may be curious that two women <a href=\"https://www.kiro7.com/news/local/women-steal-over-14000-designer-sunglasses-before-being-stopped-i-5/UF4VGRFGWBCRBLGKJZN3TDLU3U/\">recently stole $14,000 worth of sunglasses</a>, but it isn't important.</p>\n<p><strong>There will never be a police blotter.</strong> <a href=\"https://www.thejoltnews.com/stories/police-blotter-for-tuesday-november-14-2023,13000\">This kind of boring list of incidents</a> is unfair to pretty much everyone involved. It's unfair to victims as it may be false hope that the perpetrator was caught. It's unfair to readers because it doesn't portray anything of real value, only fuel for the gossip machine. It doesn't portray what police officers did during those incidents, good or bad, which is either unfair to police or unfair to readers (usually just unfair to readers). It's unfair to those arrested as they may not be the actual perpetrators, and typically don't <a href=\"https://www.americanbar.org/groups/communications_law/publications/communications_lawyer/fall2020/police-reports-shouldnt-set-news-agenda-guide-avoiding-systemic-racism-reporting/\">give essential context about the incident</a>. Police blotters and stories based solely on police reports always leave things out, typically because the source documents used leave out important information, and <a href=\"https://www.npr.org/2021/05/26/1000598495/how-police-reports-became-bulletproof\">that has a bigger impact on people of color</a>. It's unfair to the people at news orgs who have to waste their time on contextless recapping of police reports instead of working on important projects.</p>\n<p>What's important is the <a href=\"https://www.poynter.org/ethics-trust/2021/its-time-for-journalism-to-break-the-cycle-of-crime-reporting/\">public good</a> that reporting on police and courts can provide, not the clickbait-driven \"public interest\" found in copy/pasting police reports or publishing mugshots.</p>\n<p>It's far more interesting to learn about how crime is addressed in systemic ways. What are the pressures and situations that lead to crime? In what ways does police response impact crime levels? Is police response different across areas and cities in the South Sound? What methods and technologies are in use by local police? In what ways are residents being surveiled? It can be valuable to understand where, when, and why crime and police response happens in our areas, especially when we're veiwing that from the lens of addressing systemic issues and using humane approaches.</p>\n<p>This is one small example of how <em>The Mima Mercury</em> is different. More will be shared in upcoming newsletters!</p>\n<h3>Who is running this?</h3>\n<p>Hi. I'm Seth Vincent. You can learn about my <a href=\"https://www.linkedin.com/in/sethdvincent\">work history on linkedin</a> if you're curious.</p>\n<p>Here are some quick highlights:</p>\n<ul>\n<li>Studied journalism at The Evergreen State College.</li>\n<li>Worked as Evergreen staff as an associate advisor to the student newspaper, focused on technical aspects of publishing.</li>\n<li>Has a long history of experimenting with local publications and community organizing around public-interest technology.</li>\n<li>Over 13 years of software engineering work which typically focused on geographic data tools and often included user research and interviewing. It also included working with various news organizations and non-profits on website design and implementation, as well as data visualization, maps, and other visual projects.</li>\n<li>Worked at nj.com as a news apps developer.</li>\n<li>Left the software engineering world after the worst burnout I've ever experienced.</li>\n<li>Dreamed about being a reporter that works with data for a long time.</li>\n</ul>\n<p>It's kinda the Olympia way to do things ourselves, to make the cool and important things we want to see in the world. <em>The Mima Mercury</em> is how I'm doing that. I'm pretty excited.</p>\n<p><img src=\"https://media.giphy.com/media/mUVVVDMknqvcisoe4B/giphy.gif\" alt=\"A character from Our Flag Means Death saying &#x22;Oh my God, it&#x27;s finally happening&#x22;\"></p>\n<p>It would be even better if we were doing this together.</p>\n<h2>So, I have a favor to ask</h2>\n<p>My intent is to make <em>The Mima Mercury</em> my job and to build a team of people covering the South Sound.</p>\n<p>That will only happen with your help. The current budget for this work is $0. You know what rent and mortgage rates are like around Olympia, it's quite different than 15-20 years ago!</p>\n<p>Soon a membership program with interesting perks and opportunities will be created that will help sustain the ongoing efforts of <em>The Mima Mercury</em>. By donating any amount now you'll become a lifetime member.</p>\n<p><strong><a href=\"https://donate.stripe.com/4gw14n3GA8wheJOeUV\">Donate.</a></strong></p>\n<p>Or, if you feel like it's too soon for that, <a href=\"/about/contact/\">send an email</a> with a description of things you'd like to see covered in Olympia, in Thurston County, and in the broader South Sound area.</p>\n","topics":"[newsletter,newsletter_main,the_mima_mercury]","promoted":1,"published":1,"post_type":"newsletter"}]