[{"title":"Curious if your Washington State friends, family, and mortal enemies vote? You might be able to find out.","slug":"look_up_voting_history_nov_8_2023","author":"Seth Vincent","author_slug":"sethvincent","created":"11/08/2023, 5:00:00 PM","updated":"11/08/2023, 5:00:00 PM","topics":"[elections,elections_2023]","content":"<p>All you need is someone's birthday and first and last names to check out their voting history.</p>\n<p>The State of Washington <a href=\"https://voter.votewa.gov/WhereToVote.aspx\">Voter Portal</a> doesn't indicate that you can look up voting histories other than your own, but you absolutely can.</p>\n<p>Today I learned my younger sister has voted more times than me.</p>\n<img src=\"https://media.giphy.com/media/v1.Y2lkPTc5MGI3NjExcHp1dHdyb2NlN2RveHYzazJkbGlneDFjbjNrdjIwbmtoZ3BzanhzMCZlcD12MV9pbnRlcm5hbF9naWZfYnlfaWQmY3Q9Zw/nIAUTFGeAzVIc/giphy-downsized.gif\" alt=\"Will Farell saying 'I'm a little embarrassed\">\n<p>Is Washington's voter portal intended to be used this way? Probably not? Finding out people's birthdays is often easy. This portal also shares current address information. This <em>could</em> be used in harmful ways, though this information and more is freely available for every voter in the state via the <a href=\"https://www.sos.wa.gov/elections/data-research/washington-state-voter-registration-database-vrdb\">Washington State Voter Registration Database</a>.</p>\n<p>It's not possible to see <em>how</em> someone voted – that would be absurd – only a list of elections they voted in.</p>\n<p>If you have friends or family that you need to convince to vote, here's another peer pressure method you can use. It's not perfect, though. They might just start <a href=\"/posts/blank_ballots_nov_8_2023\">sending in blank ballots</a>.</p>\n","promoted":1,"published":1},{"title":"Who sends in blank ballots?","slug":"blank_ballots_nov_8_2023","author":"Seth Vincent","author_slug":"sethvincent","created":"11/08/2023, 5:00:00 PM","updated":"11/13/2023, 5:27:00 PM","topics":"[elections,elections_2023]","content":"<p>As of the latest election count update, 23 people in Thurston County, WA chose to send in blank ballots. Why have they done this?</p>\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube-nocookie.com/embed/wKbU8B-QVZk?si=Zb5-5Cwhjxcx_9kF\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen></iframe>\n<p>Were these people engaging in a <a href=\"https://en.wikipedia.org/wiki/Protest_vote\">protest vote</a>? Maybe? There don't seem to be individuals or groups encouraging that tactic this year in Thurston County, WA.</p>\n<p>The best theory I've come up with involves social pressure.</p>\n<p>These 12 people don't care about elections, but they also know that the State of Washington <a href=\"/posts/look_up_voting_history_nov_8_2023/\">provides a way to look up someone's voting history</a> based on their birthday and first/last names.</p>\n<p>Peer pressure works on these people, but only enough to lie about it.</p>\n","promoted":1,"published":1}]